app/controllers/entries_controller.rb

  def show
    @entry = Entry.find(params[:id])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 ORDER BY "entries"."created_at" DESC LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    @entry = current_user.entries.new(entry_params)
    if @entry.save
---
INSERT INTO "entries" ("titulo", "bajada", "cuerpo", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["titulo", "123"], ["bajada", "123"], ["cuerpo", "123"], ["user_id", 2], ["created_at", "2018-03-19 06:44:05.219446"], ["updated_at", "2018-03-19 06:44:05.219446"]]

  def edit
    @entry = Entry.find(params[:id])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 ORDER BY "entries"."created_at" DESC LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def update
    @entry = Entry.find(params[:id])
    respond_to do |format|
      if @entry.update(entry_params)
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 ORDER BY "entries"."created_at" DESC LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "entries" SET "titulo" = $1, "updated_at" = $2 WHERE "entries"."id" = $3  [["titulo", "1234"], ["updated_at", "2018-03-19 07:43:40.150652"], ["id", 5]]

  def destroy
    @entry.destroy
---
DELETE FROM "entries" WHERE "entries"."id" = $1  [["id", 5]]