app/controllers/static_pages_controller.rb

  def administrator
    @entry = current_user.entries.build if logged_in?
    @entries = Entry.all
---
SELECT "entries".* FROM "entries" ORDER BY "entries"."created_at" DESC